# Main URL
url = 'https://ylilit.ru/wp-admin/admin-ajax.php'
#url = 'http://10.100.7.95:5000/submit'
#url = 'http://178.208.91.155:8081/submit'


# HTTP headers
headers = {
    'Content-Type': 'application/x-www-form-urlencoded; charset=UTF-8',
    'X-Requested-With': 'XMLHttpRequest',
    'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/131.0.0.0 Safari/537.36',
    'Referer': 'https://ylilit.ru/cart/',
    'origin': 'https://ylilit.ru',
    'sec-ch-ua-mobile': '?0',
    'sec-ch-ua-platform': 'Windows',
    'sec-fetch-dest': 'document',
    'sec-fetch-mode': 'cors',
    'sec-fetch-site': 'same-origin',
    'sec-fetch-user': '?1',
    'upgrade-insecure-requests': '1'

}

# Http cookies
my_cookies = {
        '_ym_uid': '1765030150701846561',
        '_ym_d': '1765030150',
        '_ym_isad': '2',
        'beget': 'begetok',
        '_ym_visorc': 'w'
}


male_names = [
    "Александр", "Дмитрий", "Максим", "Сергей", "Андрей", "Алексей", "Артём", "Иван", "Михаил", "Никита",
    "Кирилл", "Даниил", "Егор", "Илья", "Матвей", "Роман", "Владимир", "Павел", "Ярослав", "Тимофей",
    "Николай", "Фёдор", "Константин", "Артур", "Виктор", "Олег", "Антон", "Денис", "Станислав", "Вадим",
    "Глеб", "Марк", "Лев", "Тимур", "Пётр", "Георгий", "Борис", "Вячеслав", "Евгений", "Игорь",
    "Семён", "Давид", "Платон", "Степан", "Мирон", "Василий", "Григорий", "Ростислав", "Савелий", "Всеволод"
]

# 50 женских имен
female_names = [
    "Анна", "Мария", "Елена", "Ольга", "Наталья", "Татьяна", "Ирина", "Светлана", "Екатерина", "Юлия",
    "Анастасия", "Александра", "Виктория", "Дарья", "София", "Полина", "Алиса", "Вероника", "Варвара", "Ксения",
    "Валерия", "Ева", "Милана", "Арина", "Диана", "Ульяна", "Кристина", "Алёна", "Маргарита", "Вера",
    "Надежда", "Любовь", "Злата", "Марина", "Софья", "Елизавета", "Василиса", "Кира", "Ярослава", "Эмилия",
    "Таисия", "Мия", "Стефания", "Олеся", "Инна", "Лилия", "Дарина", "Ника", "Элина", "Агата"
]
